In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [ ]:
"""
mysql> with most_used_floors as (select name, floor, dense_rank() over(partition by name  order by access_count desc) as rank_ from (select name, floor, count
(*) access_count from access_info group by 1,2) temp) select ae.name, count(*), most_used_floors.floor, group_concat(distinct resources) from access_info ae j
oin most_used_floors on ae.name=most_used_floors.name where rank_=1 group by 1,3;
+------+----------+-------+----------------------------------+
| name | count(*) | floor | group_concat(distinct resources) |
+------+----------+-------+----------------------------------+
| A    |        3 |     1 | CPU,DESKTOP                      |
| B    |        3 |     2 | DESKTOP,MONITOR                  |
+------+----------+-------+----------------------------------+
2 rows in set (0.00 sec)

"""

In [5]:
%%sql df <<
select * from test.access_info

 * mysql+mysqlconnector://tushar:***@localhost
6 rows affected.
Returning data to local variable df

In [6]:
df

  name    address         email resources  floor
0    A  Bangalore   A@gmail.com       CPU      1
1    A  Bangalore  A1@gmail.com       CPU      1
2    A  Bangalore  A2@gmail.com   DESKTOP      2
3    B  Bangalore   B@gmail.com   DESKTOP      2
4    B  Bangalore  B1@gmail.com   DESKTOP      2
5    B  Bangalore  B2@gmail.com   MONITOR      1

In [37]:
df.groupby(['name','floor']).size().reset_index()

  name  floor  0
0    A      1  2
1    A      2  1
2    B      1  1
3    B      2  2

In [40]:
resources_used = df.groupby(['name'])['resources'].apply(lambda x: ','.join(x)).reset_index()

In [36]:
grouped_data = df.groupby(['name','floor']).size().reset_index()
grouped_data.columns = ['name','floor', 'access_count']
print(grouped_data)
#grouped_data['rank'] = grouped_data['access_count'].rank(method='first')
grouped_data['rank'] = grouped_data.groupby(['name'])['access_count'].rank(ascending=False)
grouped_data

  name  floor  access_count
0    A      1             2
1    A      2             1
2    B      1             1
3    B      2             2

  name  floor  access_count  rank
0    A      1             2   1.0
1    A      2             1   2.0
2    B      1             1   2.0
3    B      2             2   1.0

In [42]:
final = pd.merge(grouped_data, resources_used, on='name')
final[final['rank']==1]

  name  floor  access_count  rank                resources
0    A      1             2   1.0          CPU,CPU,DESKTOP
3    B      2             2   1.0  DESKTOP,DESKTOP,MONITOR